import string as st

alphabet = st.digits + st.ascii_uppercase[:6]
print(alphabet)
colors = []  # пустой список для хранения цветов

# TODO: напишите программу, которая спросит
#  у пользователя, сколько цветов ему нужно,
#  сгенерирует ему эти цвета и добавит их в список
#  список нужно вывести
