"""
Напишите программу, которая будет вычислять площадь
прямоугольного треугольника.
"""
b = int(input('Основание треугольника: '))
h = int(input('Высота треугольника: '))
print('Площадь: ', 1 / 2 * b * h)

