"""
Напишите программу, которая считает длину окружности
"""
r = int(input('Введите радиус круга: '))  # значение переменной, которое задается с клавиатуры
pi = 3.14  # значение переменной, которое задано жестко
print('Длина окружности: ', 2 * pi * r)

